package Day01_설계;

public class Day01_과제설명 {
//	* 타워 주차 프로그램 [ 주차관리인 만 사용O  일반고객X ] 
//			조건1 : 3층 짜리 주차타워일 경우 층별 4개씩 주차 가능 
//				1층 [ ] [ ] [ ] [ ]
//				2층 [ ] [ ] [ ] [ ]
//				3층 [ ] [ ] [ ] [ ]
//
//			조건2 : 메뉴 : 1.입차 2.출차 3.매출확인
//				입차시 : 차량번호[4자리] 입력받아 주차타워에 자리가 있을경우 주차 
//				출차시 : 차량번호[4자리] 를 입력받아 출차시 금액계산
//					* 금액표 
//						1 .최초 30분 무료 
//						2. 30분 이후부터 10분당 1000원
//						3. 하루 최대 5만원 부과
//						4. 1일당 5만원
//
//				매출확인시 : 연도 , 월 입력받아 해당 월의 일별 매출 출력 / 매출이 없는 경우 없다 .
//
//			조건3 : 클래스 , 파일처리 , Arraylist , 예외처리 필수 사용 [ 그외 선택 사항 ] 
//
//			
//			// 조 별 각자 본인 작성한 메소드[코드]
//				// 김현수 : 입차메소드 
//				// 유재석 : 출차메소드
//				//  
//			// git 저장소 새로 만들어서 각 조별 팀 초대
//	출차 계산
//
//	파일 총 4개 : 주차 클래스, 메인 클래스, 컨트롤러 클래스, 계산 클래스
//
//	실행
//
//	몇층 짜리인지 입력받음
//
//	주차장을 만든다.
//
//	메뉴를 띄움
//
//	사용자가 입차를 입력 차번호 입력받음 차 자리가 있으면 주차 완료 띄우고 끝 차 자리 없으면 만차 띄우고 초기메뉴로...
//
//	사용자가 출차를 입력 차 번호 입력받아야 됨 시간계산 후 금액표에 맞게 내야하는 돈을 출력 돈 입력받고 모자라면 더 넣어줘 맞거나 돈을 더 주면 잔돈 줘 끝
//
//	매출 결제된 금액들을 합쳐서 (연도, 월) : 000원 .txt로 저장
//
//	불러오기 할때 연도 월 입력받아서 그날 데이터 출력하면 끝
}
